import {Component} from '@angular/core';

@Component({
  selector: 'app-questions',
  templateUrl: './questions.component.html',
  styleUrls: ['./questions.component.less']
})
export class QuestionsComponent {
  panels = [
    {
      active: true,
      title: 'Сайтга қандай қилиб ўз махсулотимни жойлаштиришим мумкин?',
      name: 'Сайтга махсулотингизни жойлашдан аввал сиз юридик малумотларингизни тақдим етишингиз керак бўлади. Шундан сўнг шахсий кабинетиниздаги "Махсулот қўшиш" бўлими орқали ўз махсулотингизни қўшишингиз мумкин',
      childPanel: [
        {
          active: false,
          name: 'This is panel header 1-1'
        }
      ]
    },
    {
      active: false,
      title: 'Сотувчи билан қандай алоқа ўрнатиш мумкин?',
      name: 'Сайтга махсулотингизни жойлашдан аввал сиз юридик малумотларингизни тақдим етишингиз керак бўлади. Шундан сўнг шахсий кабинетиниздаги "Махсулот қўшиш" бўлими орқали ўз махсулотингизни қўшишингиз мумкин'
    },
    {
      active: false,
      title: "Тизимдан рўйхатдан ўтмасдан махсулот харид қилиш мумкинми?",
      name: 'Сайтга махсулотингизни жойлашдан аввал сиз юридик малумотларингизни тақдим етишингиз керак бўлади. Шундан сўнг шахсий кабинетиниздаги "Махсулот қўшиш" бўлими орқали ўз махсулотингизни қўшишингиз мумкин'
    },{
      active: false,
      title: "Қўшилган махсулот қанча вақт ичида сайтга жойланади?",
      name: 'Сайтга махсулотингизни жойлашдан аввал сиз юридик малумотларингизни тақдим етишингиз керак бўлади. Шундан сўнг шахсий кабинетиниздаги "Махсулот қўшиш" бўлими орқали ўз махсулотингизни қўшишингиз мумкин'
    },{
      active: false,
      title: "Тизим оператори билан қандай боғланиш мумкин?",
      name: 'Сайтга махсулотингизни жойлашдан аввал сиз юридик малумотларингизни тақдим етишингиз керак бўлади. Шундан сўнг шахсий кабинетиниздаги "Махсулот қўшиш" бўлими орқали ўз махсулотингизни қўшишингиз мумкин'
    },
  ];
}

