import {Component, OnInit} from '@angular/core';

@Component({
  selector: 'app-seeds',
  templateUrl: './seeds.component.html',
  styleUrls: ['./seeds.component.less']
})
export class SeedsComponent implements OnInit {
  carouselArray = [
    {
      banner: "../../../../../assets/categories/banner1.jpg",
      title: "Сифрокс 500 енди чегирмали нархларда"
    },
    {
      banner: "../../../../../assets/categories/banner2.jpg",
      title: "Боғ ва томорқа учун барча керакли махсулотлар"
    },
    {
      banner: "../../../../../assets/categories/banner3.jpg",
      title: "Сифатли ветеринария хизматидан фойдаланинг"
    },
    {
      banner: "../../../../../assets/categories/banner4.jpg",
      title: "Дон махсулотлари ва уруғлари келишилган нархларда"
    },
    {
      banner: "../../../../../assets/categories/banner5.jpg",
      title: "Қишлоқ хўжалиги ускуналари арзон нархларда"
    },

  ]
  cards = [
    {
      id: 1,
      imageUrl: "../../../../../assets/categories/1.jpg",
      title: "Қизил Юсуф памидори",
      supplier: "МЧЖ \"Green technology\"",
      description: "Ўсимликнинг баландлиги 1 метрга етади, екиш пайтида уни зарур ишларни амалга ошириш керак. Озиқ-овқат маҳсулотларидан ташқари, нўхат жуда декоратив кўриришга ега бўлади. ",
      price: 459000000,
      weight: 100000,
      tags: ["Томат","Бодринг","Сабзи","Карам","Карам"]
    },
    {
      id: 2,
      imageUrl: "../../../../../assets/categories/2.jpg",
      title: "Қизил Юсуф памидори",
      supplier: "МЧЖ \"Green technology\"",
      description: "Ўсимликнинг баландлиги 1 метрга етади, екиш пайтида уни зарур ишларни амалга ошириш керак. Озиқ-овқат маҳсулотларидан ташқари, нўхат жуда декоратив кўриришга ега бўлади. ",
      price: 459000000,
      weight: 100000,
      tags: ["Томат","Бодринг","Сабзи","Карам","Карам"]
    },
    {
      id: 3,
      imageUrl: "../../../../../assets/categories/3.jpg",
      title: "Қизил Юсуф памидори",
      supplier: "МЧЖ \"Green technology\"",
      description: "Ўсимликнинг баландлиги 1 метрга етади, екиш пайтида уни зарур ишларни амалга ошириш керак. Озиқ-овқат маҳсулотларидан ташқари, нўхат жуда декоратив кўриришга ега бўлади. ",
      price: 459000000,
      weight: 100000,
      tags: ["Томат","Бодринг","Сабзи","Карам","Карам"]
    },
    {
      id: 4,
      imageUrl: "../../../../../assets/categories/4.jpg",
      title: "Қизил Юсуф памидори",
      supplier: "МЧЖ \"Green technology\"",
      description: "Ўсимликнинг баландлиги 1 метрга етади, екиш пайтида уни зарур ишларни амалга ошириш керак. Озиқ-овқат маҳсулотларидан ташқари, нўхат жуда декоратив кўриришга ега бўлади. ",
      price: 459000000,
      weight: 100000,
      tags: ["Томат","Бодринг","Сабзи","Карам","Карам"]
    },
    {
      id: 5,
      imageUrl: "../../../../../assets/categories/5.jpg",
      title: "Қизил Юсуф памидори",
      supplier: "МЧЖ \"Green technology\"",
      description: "Ўсимликнинг баландлиги 1 метрга етади, екиш пайтида уни зарур ишларни амалга ошириш керак. Озиқ-овқат маҳсулотларидан ташқари, нўхат жуда декоратив кўриришга ега бўлади. ",
      price: 459000000,
      weight: 100000,
      tags: ["Томат","Бодринг","Сабзи","Карам","Карам"]
    },
    {
      id: 6,
      imageUrl: "../../../../../assets/categories/6.jpg",
      title: "Қизил Юсуф памидори",
      supplier: "МЧЖ \"Green technology\"",
      description: "Ўсимликнинг баландлиги 1 метрга етади, екиш пайтида уни зарур ишларни амалга ошириш керак. Озиқ-овқат маҳсулотларидан ташқари, нўхат жуда декоратив кўриришга ега бўлади. ",
      price: 459000000,
      weight: 100000,
      tags: ["Томат","Бодринг","Сабзи","Карам","Карам"]
    },
    {
      id: 7,
      imageUrl: "../../../../../assets/categories/1.jpg",
      title: "Қизил Юсуф памидори",
      supplier: "МЧЖ \"Green technology\"",
      description: "Ўсимликнинг баландлиги 1 метрга етади, екиш пайтида уни зарур ишларни амалга ошириш керак. Озиқ-овқат маҳсулотларидан ташқари, нўхат жуда декоратив кўриришга ега бўлади. ",
      price: 459000000,
      weight: 100000,
      tags: ["Томат","Бодринг","Сабзи","Карам","Карам"]
    },
  ]

  constructor() {
  }

  ngOnInit(): void {
  }


}
